week02/presentation.org
#+TITLE: CMPUT201W20B2 Week 2
#+PROPERTY: header-args:C             :results output :exports both :flags -std=c99 -Wall -pedantic -Werror -g 
#+PROPERTY: header-args:sh            :results output :exports both

* Week2
** Copyright Statement

If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.

Otherwise it is (c) 2020 Abram Hindle under the Apache
2 License.  Unless it is Hazel Code! Which is AGPL3.0!

*** Hazel Code is licensed under AGPL3.0+

Also found here https://github.com/hazelybell/examples/tree/C-2020-01

Hazel code is licensed: The example code is licensed under the AGPL3+ license, unless otherwise noted.

*** Apache 2 Preamble
Copyright 2020 Hazel Campbell, Abram Hindle

Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at

    http://www.apache.org/licenses/LICENSE-2.0

Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
** Init ORG-MODE
;; I need this for org-mode to work well

(require 'ob-sh)
;(require 'ob-shell)
(org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(setq org-src-fontify-natively t)

** Org Template
Copy and paste this to demo C

#+BEGIN_SRC C :exports both
#include <stdio.h>

int main(int argc, char**argv) {
    return 0;
}
#+END_SRC

#+RESULTS:

** Remember how to compile?

gcc -std=c99 -Wall -pedantic -Werror -o programname programname.c

** Unary versus Binary

#+BEGIN_SRC C :exports both 
#include <stdio.h>

int main() {
    int an_int = -5; // unary
    int another_int = an_int + an_int; //binary
    printf("an_int=\t%d\n", an_int);
    printf("another_int=\t%d\n", another_int);
    ++an_int;
    another_int = -(an_int) + +(an_int); //binary and unary
    printf("another_int=\t%d\n", another_int);
    another_int = -(an_int) + -(an_int); //binary and unary
    printf("another_int=\t%d\n", another_int);
    return 0;
}
#+END_SRC

#+RESULTS:
: an_int=	-5
: another_int=	-10
: another_int=	0
: another_int=	8

