week02/presentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-03-10 Tue 10:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CMPUT201W20B2 Week 2</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Abram Hindle" />
</head>
<body>
<div id="content">
<h1 class="title">CMPUT201W20B2 Week 2</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org31ab68f">1. Week2</a>
<ul>
<li><a href="#orgd4a5735">1.1. Copyright Statement</a>
<ul>
<li><a href="#org3a8c1d3">1.1.1. Hazel Code is licensed under AGPL3.0+</a></li>
<li><a href="#org33737c7">1.1.2. Apache 2 Preamble</a></li>
</ul>
</li>
<li><a href="#orga39c1de">1.2. Init ORG-MODE</a>
<ul>
<li><a href="#org0b2f9ca">1.2.1. Org export</a></li>
</ul>
</li>
<li><a href="#orgad240cf">1.3. Org Template</a></li>
<li><a href="#org98fd617">1.4. Remember how to compile?</a></li>
<li><a href="#orgef7096b">1.5. Unary versus Binary</a></li>
<li><a href="#org82d5e77">1.6. Arithmetic</a></li>
<li><a href="#org42c1865">1.7. Assignments in Expressions [Hazel Example]</a></li>
<li><a href="#orgdc4db9b">1.8. Order of operations from Hazel</a></li>
<li><a href="#orgdff0641">1.9. L-value from Hazel</a></li>
<li><a href="#org6597619">1.10. Boolean Values</a></li>
<li><a href="#org4cf71b5">1.11. Boolean Values from Hazel</a></li>
<li><a href="#orgd1b1b1c">1.12. Pre and Post Increment</a>
<ul>
<li><a href="#org3162d46">1.12.1. Code for x++ and ++x</a></li>
<li><a href="#orgc8b377c">1.12.2. Objdump it!</a></li>
<li><a href="#orgba556ad">1.12.3. Objdump Main</a></li>
</ul>
</li>
<li><a href="#org0e8dd26">1.13. Comma Operator from Hazel</a></li>
<li><a href="#org3250418">1.14. If statements</a></li>
<li><a href="#orgdd8ae6e">1.15. Blocks! from Hazel</a></li>
<li><a href="#orgd9280b4">1.16. Ternary Statements</a></li>
<li><a href="#org23a5063">1.17. Switch Statements</a></li>
<li><a href="#orgef123c1">1.18. Switch Statements [code from Hazel]</a></li>
<li><a href="#org2db431b">1.19. While loops</a></li>
<li><a href="#org43672a0">1.20. For loops</a>
<ul>
<li><a href="#orgf0a17f0">1.20.1. Idiomatic For Loops</a></li>
<li><a href="#orge65360c">1.20.2. Hazel's Gallery of Misfit For Loops</a></li>
</ul>
</li>
<li><a href="#org3ce9397">1.21. Break and For</a>
<ul>
<li><a href="#orgf1e550c">1.21.1. Continue</a></li>
</ul>
</li>
<li><a href="#orgaa7426e">1.22. GOTO</a></li>
<li><a href="#org002e5aa">1.23. Types!</a>
<ul>
<li><a href="#orgf223cfd">1.23.1. int!</a></li>
<li><a href="#org110e424">1.23.2. unsigned ints!</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org31ab68f" class="outline-2">
<h2 id="org31ab68f"><span class="section-number-2">1</span> Week2</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd4a5735" class="outline-3">
<h3 id="orgd4a5735"><span class="section-number-3">1.1</span> Copyright Statement</h3>
<div class="outline-text-3" id="text-1-1">
<p>
If you are in CMPUT201 at UAlberta this code is released in the public
domain to you.
</p>

<p>
Otherwise it is (c) 2020 Abram Hindle under the Apache
2 License.  Unless it is Hazel Code! Which is AGPL3.0!
</p>
</div>

<div id="outline-container-org3a8c1d3" class="outline-4">
<h4 id="org3a8c1d3"><span class="section-number-4">1.1.1</span> Hazel Code is licensed under AGPL3.0+</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Also found here <a href="https://github.com/hazelybell/examples/tree/C-2020-01">https://github.com/hazelybell/examples/tree/C-2020-01</a>
</p>

<p>
Hazel code is licensed: The example code is licensed under the AGPL3+ license, unless otherwise noted.
</p>
</div>
</div>

<div id="outline-container-org33737c7" class="outline-4">
<h4 id="org33737c7"><span class="section-number-4">1.1.2</span> Apache 2 Preamble</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Copyright 2020 Hazel Campbell, Abram Hindle
</p>

<p>
Licensed under the Apache License, Version 2.0 (the "License");
you may not use this file except in compliance with the License.
You may obtain a copy of the License at
</p>

<p>
<a href="http://www.apache.org/licenses/LICENSE-2.0">http://www.apache.org/licenses/LICENSE-2.0</a>
</p>

<p>
Unless required by applicable law or agreed to in writing, software
distributed under the License is distributed on an "AS IS" BASIS,
WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
See the License for the specific language governing permissions and
limitations under the License.
</p>
</div>
</div>
</div>
<div id="outline-container-orga39c1de" class="outline-3">
<h3 id="orga39c1de"><span class="section-number-3">1.2</span> Init ORG-MODE</h3>
<div class="outline-text-3" id="text-1-2">
<p>
;; I need this for org-mode to work well
</p>

<p>
(require 'ob-sh)
;(require 'ob-shell)
(org-babel-do-load-languages 'org-babel-load-languages '((sh . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((C . t)))
(org-babel-do-load-languages 'org-babel-load-languages '((python . t)))
(setq org-src-fontify-natively t)
</p>
</div>

<div id="outline-container-org0b2f9ca" class="outline-4">
<h4 id="org0b2f9ca"><span class="section-number-4">1.2.1</span> Org export</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">
<pre class="src src-elisp">(org-html-export-to-html)
(org-latex-export-to-pdf)
(org-ascii-export-to-ascii)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgad240cf" class="outline-3">
<h3 id="orgad240cf"><span class="section-number-3">1.3</span> Org Template</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Copy and paste this to demo C
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org98fd617" class="outline-3">
<h3 id="org98fd617"><span class="section-number-3">1.4</span> Remember how to compile?</h3>
<div class="outline-text-3" id="text-1-4">
<p>
gcc -std=c99 -Wall -pedantic -Werror -o programname programname.c
</p>
</div>
</div>

<div id="outline-container-orgef7096b" class="outline-3">
<h3 id="orgef7096b"><span class="section-number-3">1.5</span> Unary versus Binary</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span> = -5; <span style="color: #b22222;">// </span><span style="color: #b22222;">unary</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">another_int</span> = an_int + an_int; <span style="color: #b22222;">//</span><span style="color: #b22222;">binary</span>
    printf(<span style="color: #8b2252;">"an_int=\t%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"another_int=\t%d\n"</span>, another_int);
    ++an_int;
    another_int = -(an_int) + +(an_int); <span style="color: #b22222;">//</span><span style="color: #b22222;">binary and unary</span>
    printf(<span style="color: #8b2252;">"another_int=\t%d\n"</span>, another_int);
    another_int = -(an_int) + -(an_int); <span style="color: #b22222;">//</span><span style="color: #b22222;">binary and unary</span>
    printf(<span style="color: #8b2252;">"another_int=\t%d\n"</span>, another_int);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
an_int=	-5
another_int=	-10
another_int=	0
another_int=	8

</pre>
</div>
</div>
