week02/presentation.org
** Arithmetic 

Arithmetic operators have precedence. 

#+BEGIN_SRC C :exports both
#include <stdio.h>

int main() {
    int an_int = 5;
    int another_int = an_int + an_int;
    printf("another_int=%d\n", another_int);

    another_int = an_int * an_int;
    printf("(an_int*an_int) another_int=%d\n", another_int);
    int order1 = an_int * an_int + an_int * an_int / an_int;
    int order2 = (an_int * an_int) + ((an_int * an_int) / an_int);
    int order3 = an_int * (an_int + (an_int * (an_int / (an_int))));
    if ( !((order1) == order2) ) {
        printf("order1 != order2\n");
    } else {
        printf("order1 == order2\n");
    }
    if (order1 == order3) {
        printf("order1 == order3\n");
    } else {
        printf("order1 != order3\n");
    }
    
}
#+END_SRC

#+RESULTS:
: another_int=10
: (an_int*an_int) another_int=25
: order1 == order2
: order1 != order3


** Assignments in Expressions [Hazel Example]

This is a popular feature of C that causes a lot of bugs and lot of
confusion with C.

#+BEGIN_SRC C :exports both
#include <stdio.h>

int main() {
    int an_int = 5;
    printf("an_int=%d\n", an_int);
    // We can use an assignment as an expression!
    printf("(an_int = 2)=%d\n", an_int = 2);
    printf("(an_int = 5) > 5: ");
    if ((an_int = 5) > 5) {
        printf("true\n");
    } else {
        printf("false\n");
    }
    printf("(an_int *= 3) > 5: ");
    if ((an_int *=  3) > 5) {
        printf("true\n");
    } else {
        printf("false\n");
    }
    printf("an_int is now = %d\n", an_int);
    return 0;
}
#+END_SRC

#+RESULTS:
: an_int=5
: (an_int = 2)=2
: (an_int = 5) > 5: false
: (an_int *= 3) > 5: false
: an_int is now = 1

** Order of operations from Hazel

Order of operations for l-values is from right to left

#+BEGIN_SRC C :exports both :flags "-std=c99 -Wall -pedantic"
#include <stdio.h>
#include <stdlib.h>

int main() {
    int one = 1;
    int two = 2;
    int three = one = two;     // does three == one or does three == two
    printf("one=%d\n", one);
    printf("two=%d\n", two);
    printf("three=%d\n", three);
    printf("(one++)=%d (one*=2)=%d\n", one++, one *= 2);
    one = 2;
    one *= 2;
    //one++
    int tmp = one;
    one += 1;
    printf("(one++)=%d (one*=2)=%d\n", tmp, one);

    return 0;
}
#+END_SRC

#+RESULTS:
: one=2
: two=2
: three=2
: (one++)=4 (one*=2)=5

