week02/presentation.html

<div id="outline-container-org82d5e77" class="outline-3">
<h3 id="org82d5e77"><span class="section-number-3">1.6</span> Arithmetic</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Arithmetic operators have precedence. 
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span> = 5;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">another_int</span> = an_int + an_int;
    printf(<span style="color: #8b2252;">"another_int=%d\n"</span>, another_int);

    another_int = an_int * an_int;
    printf(<span style="color: #8b2252;">"(an_int*an_int) another_int=%d\n"</span>, another_int);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">order1</span> = an_int * an_int + an_int * an_int / an_int;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">order2</span> = (an_int * an_int) + ((an_int * an_int) / an_int);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">order3</span> = an_int * (an_int + (an_int * (an_int / (an_int))));
    <span style="color: #a020f0;">if</span> ( !((order1) == order2) ) {
        printf(<span style="color: #8b2252;">"order1 != order2\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"order1 == order2\n"</span>);
    }
    <span style="color: #a020f0;">if</span> (order1 == order3) {
        printf(<span style="color: #8b2252;">"order1 == order3\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"order1 != order3\n"</span>);
    }

}
</pre>
</div>

<pre class="example">
another_int=10
(an_int*an_int) another_int=25
order1 == order2
order1 != order3

</pre>
</div>
</div>


<div id="outline-container-org42c1865" class="outline-3">
<h3 id="org42c1865"><span class="section-number-3">1.7</span> Assignments in Expressions [Hazel Example]</h3>
<div class="outline-text-3" id="text-1-7">
<p>
This is a popular feature of C that causes a lot of bugs and lot of
confusion with C.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span> = 5;
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">We can use an assignment as an expression!</span>
    printf(<span style="color: #8b2252;">"(an_int = 2)=%d\n"</span>, an_int = 2);
    printf(<span style="color: #8b2252;">"(an_int = 5) &gt; 5: "</span>);
    <span style="color: #a020f0;">if</span> ((an_int = 5) &gt; 5) {
        printf(<span style="color: #8b2252;">"true\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"false\n"</span>);
    }
    printf(<span style="color: #8b2252;">"(an_int *= 3) &gt; 5: "</span>);
    <span style="color: #a020f0;">if</span> ((an_int *=  3) &gt; 5) {
        printf(<span style="color: #8b2252;">"true\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"false\n"</span>);
    }
    printf(<span style="color: #8b2252;">"an_int is now = %d\n"</span>, an_int);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
an_int=5
(an_int = 2)=2
(an_int = 5) &gt; 5: false
(an_int *= 3) &gt; 5: true
an_int is now = 15

</pre>
</div>
</div>

<div id="outline-container-orgdc4db9b" class="outline-3">
<h3 id="orgdc4db9b"><span class="section-number-3">1.8</span> Order of operations from Hazel</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Order of operations for l-values is from right to left
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">one</span> = 1;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">two</span> = 2;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">three</span> = one = two;     <span style="color: #b22222;">// </span><span style="color: #b22222;">does three == one or does three == two</span>
    printf(<span style="color: #8b2252;">"one=%d\n"</span>, one);
    printf(<span style="color: #8b2252;">"two=%d\n"</span>, two);
    printf(<span style="color: #8b2252;">"three=%d\n"</span>, three);
    printf(<span style="color: #8b2252;">"(one++)=%d (one*=2)=%d\n"</span>, one++, one *= 2);
    one = 2;
    one *= 2;
    <span style="color: #b22222;">//</span><span style="color: #b22222;">one++</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tmp</span> = one;
    one += 1;
    printf(<span style="color: #8b2252;">"(one++)=%d (one*=2)=%d\n"</span>, tmp, one);

    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
one=2
two=2
three=2
(one++)=4 (one*=2)=5
(one++)=4 (one*=2)=5

</pre>
</div>
</div>
