week02/presentation.html

<div id="outline-container-orgdff0641" class="outline-3">
<h3 id="orgdff0641"><span class="section-number-3">1.9</span> L-value from Hazel</h3>
<div class="outline-text-3" id="text-1-9">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">N</span> 5

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span> = 5;
    printf(<span style="color: #8b2252;">"an_int = 5\n"</span>);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    an_int = 2;
    printf(<span style="color: #8b2252;">"an_int = 2\n"</span>);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">an_int is an "lvalue"</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">aka. left value</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">anything that can appear on the left of an assignment</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">we can also use ++ and -- with lvalues</span>
    an_int += 20;
    printf(<span style="color: #8b2252;">"an_int += 20\n"</span>);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"an_int++=%d\n"</span>, an_int++);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"++an_int=%d\n"</span>, ++an_int);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    an_int *= 10;
    printf(<span style="color: #8b2252;">"an_int *= 10\n"</span>);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"an_int--=%d\n"</span>, an_int--);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"--an_int=%d\n"</span>, --an_int);
    printf(<span style="color: #8b2252;">"an_int=%d\n"</span>, an_int);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">None of the following work, because they are NOT lvalues!</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">5 = 2;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">5 *= 10;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">5++;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">N = 2;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">N *= 10;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">N++;</span>
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
an_int = 5
an_int=5
an_int = 2
an_int=2
an_int += 20
an_int=22
an_int++=22
an_int=23
++an_int=24
an_int=24
an_int *= 10
an_int=240
an_int--=240
an_int=239
--an_int=238
an_int=238
</pre>
</div>
</div>

<div id="outline-container-org6597619" class="outline-3">
<h3 id="org6597619"><span class="section-number-3">1.10</span> Boolean Values</h3>
<div class="outline-text-3" id="text-1-10">
<p>
C has an idea of truthy values and false values.
</p>

<p>
A 0, null, or 0.0f is a false value.
</p>

<p>
Anything else is a true value. This means that all arrays and strings
are true. All characters except \0 are true. All floating point values
that are not 0.0f or -0.0f are true.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">chars</span>[1024];
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">emptystring</span>[1024] = <span style="color: #8b2252;">""</span>;
    <span style="color: #a020f0;">if</span> ( 0.0f ) {
        printf(<span style="color: #8b2252;">"0.0f is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"0.0f is not true!\n"</span>);
    }
    <span style="color: #a020f0;">if</span> ( -0.0f ) {
        printf(<span style="color: #8b2252;">"-0.0f is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"-0.0f is not true!\n"</span>);
    }
    <span style="color: #a020f0;">if</span> ( emptystring ) {
        printf(<span style="color: #8b2252;">"emptystring is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"emptystring is not true!\n"</span>);
    }
    <span style="color: #a020f0;">if</span> ( chars ) {
        printf(<span style="color: #8b2252;">"character array is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"character array is not true!\n"</span>);
    }
    <span style="color: #a020f0;">if</span> ( 0 ) {
        printf(<span style="color: #8b2252;">"0 is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"0 is not true!\n"</span>);
    }
    <span style="color: #a020f0;">if</span> ( emptystring[0] ) {
        printf(<span style="color: #8b2252;">"emptystring[0] is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"emptystring[0] is not true!\n"</span>);
    }
    <span style="color: #228b22;">char</span> * <span style="color: #a0522d;">nostringatall</span> = <span style="color: #008b8b;">NULL</span>; 
    <span style="color: #a020f0;">if</span> ( nostringatall ) {
        printf(<span style="color: #8b2252;">"nostringatall is true!\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"nostringatall is not true!\n"</span>);
    }

    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
0.0f is not true!
-0.0f is not true!
emptystring is true!
character array is true!
0 is not true!
emptystring[0] is not true!
nostringatall is not true!

</pre>
</div>
</div>
