week02/presentation.txt


1.9 L-value from Hazel
~~~~~~~~~~~~~~~~~~~~~~

  ,----
  | #include <stdio.h>
  | 
  | #define N 5
  | 
  | int main() {
  |     int an_int = 5;
  |     printf("an_int = 5\n");
  |     printf("an_int=%d\n", an_int);
  |     an_int = 2;
  |     printf("an_int = 2\n");
  |     printf("an_int=%d\n", an_int);
  |     // an_int is an "lvalue"
  |     // aka. left value
  |     // anything that can appear on the left of an assignment
  |     // we can also use ++ and -- with lvalues
  |     an_int += 20;
  |     printf("an_int += 20\n");
  |     printf("an_int=%d\n", an_int);
  |     printf("an_int++=%d\n", an_int++);
  |     printf("an_int=%d\n", an_int);
  |     printf("++an_int=%d\n", ++an_int);
  |     printf("an_int=%d\n", an_int);
  |     an_int *= 10;
  |     printf("an_int *= 10\n");
  |     printf("an_int=%d\n", an_int);
  |     printf("an_int--=%d\n", an_int--);
  |     printf("an_int=%d\n", an_int);
  |     printf("--an_int=%d\n", --an_int);
  |     printf("an_int=%d\n", an_int);
  |     // None of the following work, because they are NOT lvalues!
  |     // 5 = 2;
  |     // 5 *= 10;
  |     // 5++;
  |     // N = 2;
  |     // N *= 10;
  |     // N++;
  |     return 0;
  | }
  `----

  ,----
  | an_int = 5
  | an_int=5
  | an_int = 2
  | an_int=2
  | an_int += 20
  | an_int=22
  | an_int++=22
  | an_int=23
  | ++an_int=24
  | an_int=24
  | an_int *= 10
  | an_int=240
  | an_int--=240
  | an_int=239
  | --an_int=238
  | an_int=238
  `----


1.10 Boolean Values
~~~~~~~~~~~~~~~~~~~

  C has an idea of truthy values and false values.

  A 0, null, or 0.0f is a false value.

  Anything else is a true value. This means that all arrays and strings
  are true. All characters except \0 are true. All floating point values
  that are not 0.0f or -0.0f are true.

  ,----
  | #include <stdbool.h>
  | #include <stdio.h>
  | #include <stdlib.h>
  | 
  | int main() {
  |     char chars[1024];
  |     char emptystring[1024] = "";
  |     if ( 0.0f ) {
  |         printf("0.0f is true!\n");
  |     } else {
  |         printf("0.0f is not true!\n");
  |     }
  |     if ( -0.0f ) {
  |         printf("-0.0f is true!\n");
  |     } else {
  |         printf("-0.0f is not true!\n");
  |     }
  |     if ( emptystring ) {
  |         printf("emptystring is true!\n");
  |     } else {
  |         printf("emptystring is not true!\n");
  |     }
  |     if ( chars ) {
  |         printf("character array is true!\n");
  |     } else {
  |         printf("character array is not true!\n");
  |     }
  |     if ( 0 ) {
  |         printf("0 is true!\n");
  |     } else {
  |         printf("0 is not true!\n");
  |     }
  |     if ( emptystring[0] ) {
  |         printf("emptystring[0] is true!\n");
  |     } else {
  |         printf("emptystring[0] is not true!\n");
  |     }
  |     char * nostringatall = NULL; 
  |     if ( nostringatall ) {
  |         printf("nostringatall is true!\n");
  |     } else {
  |         printf("nostringatall is not true!\n");
  |     }
  | 
  |     return 0;
  | }
  `----

  ,----
  | 0.0f is not true!
  | -0.0f is not true!
  | emptystring is true!
  | character array is true!
  | 0 is not true!
  | emptystring[0] is not true!
  | nostringatall is not true!
  `----
