week02/presentation.html


<div id="outline-container-org4cf71b5" class="outline-3">
<h3 id="org4cf71b5"><span class="section-number-3">1.11</span> Boolean Values from Hazel</h3>
<div class="outline-text-3" id="text-1-11">
<p>
<a href="./bool.c">./bool.c</a>
</p>

<div class="org-src-container">
<pre class="src src-sh">gcc -v -g -O0 -std=c99 -Wall -pedantic -o bool bool.c
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">echo</span> 2 | ./bool
</pre>
</div>

<p>
enter a number from 0-3: a is two
(a<sub>number</sub> &lt; 2)=0
(a<sub>number</sub> == 2)=1
true=1
false=0
lt<sub>two</sub>=0
(lt<sub>two</sub>): false
lt<sub>two</sub><sub>int</sub>=0
(lt<sub>two</sub><sub>int</sub>): false
(1 <code>= true): 1
(2 =</code> true): 0
4 &lt; a<sub>number</sub> &lt; 10: true
(a<sub>number</sub> &lt; 2 ? 111 : 222)=222
</p>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdbool.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a_number</span> = -1;
    printf(<span style="color: #8b2252;">"enter a number from 0-3: "</span>);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">scanf_result</span> = scanf(<span style="color: #8b2252;">"%d"</span>, &amp;a_number);
    <span style="color: #a020f0;">if</span> (scanf_result != 1) {
        printf(<span style="color: #8b2252;">"Error: didn't read a number!\n"</span>);
        abort();
    }

    <span style="color: #a020f0;">if</span> (a_number &lt; 2) {
        printf(<span style="color: #8b2252;">"a less than two\n"</span>);
    } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> (a_number == 2) {
        printf(<span style="color: #8b2252;">"a is two\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"a is greater than two\n"</span>);
    }

    printf(<span style="color: #8b2252;">"(a_number &lt; 2)=%d\n"</span>, a_number &lt; 2);

    printf(<span style="color: #8b2252;">"(a_number == 2)=%d\n"</span>, a_number == 2);

    <span style="color: #b22222;">// </span><span style="color: #b22222;">using true and false by name: be sure to include &lt;stdbool.h&gt;</span>
    printf(<span style="color: #8b2252;">"true=%d\n"</span>, <span style="color: #008b8b;">true</span>);
    printf(<span style="color: #8b2252;">"false=%d\n"</span>, <span style="color: #008b8b;">false</span>);

    <span style="color: #228b22;">bool</span> <span style="color: #a0522d;">lt_two</span> = a_number &lt; 2;
    printf(<span style="color: #8b2252;">"lt_two=%d\n"</span>, lt_two);

    printf(<span style="color: #8b2252;">"(lt_two): "</span>);
    <span style="color: #a020f0;">if</span> (lt_two) {
        printf(<span style="color: #8b2252;">"true\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"false\n"</span>);
    }

    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">lt_two_int</span> = a_number &lt; 2;
    printf(<span style="color: #8b2252;">"lt_two_int=%d\n"</span>, lt_two_int);

    printf(<span style="color: #8b2252;">"(lt_two_int): "</span>);
    <span style="color: #a020f0;">if</span> (lt_two_int) {
        printf(<span style="color: #8b2252;">"true\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"false\n"</span>);
    }

    <span style="color: #b22222;">// </span><span style="color: #b22222;">NEVER do == true, because any number that's not 0 is true.</span>
    printf(<span style="color: #8b2252;">"(1 == true): %d\n"</span>, 1 == <span style="color: #008b8b;">true</span>);
    printf(<span style="color: #8b2252;">"(2 == true): %d\n"</span>, 2 == <span style="color: #008b8b;">true</span>);


    <span style="color: #b22222;">// </span><span style="color: #b22222;">to fix this 4 &lt; a &amp;&amp; a &lt; 10</span>
    printf(<span style="color: #8b2252;">"4 &lt; a_number &lt; 10: "</span>);
    <span style="color: #a020f0;">if</span> ((4 &lt; a_number) &amp;&amp; (a_number &lt; 10)) {
        printf(<span style="color: #8b2252;">"true\n"</span>);
    } <span style="color: #a020f0;">else</span> {
        printf(<span style="color: #8b2252;">"false\n"</span>);
    }
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tmp</span> = 0;
    <span style="color: #a020f0;">if</span> (a_number &lt; 2) {
       tmp = 111;
    } <span style="color: #a020f0;">else</span> {
       tmp = 222;
    }
    tmp = (a_number &lt; 2 ? 111 : 222);
    a_number &lt; 2 ? tmp = 111 : tmp = 222;
    printf(<span style="color: #8b2252;">"(a_number &lt; 2 ? 111 : 222)=%d\n"</span>, tmp);
    printf(<span style="color: #8b2252;">"(a_number &lt; 2 ? 111 : 222)=%d\n"</span>, (a_number &lt; 2 ? 111 : 222));
    (a_number &lt; 2 ? 111 :((a_number &lt; 1)? 000 : 222));
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1b1b1c" class="outline-3">
<h3 id="orgd1b1b1c"><span class="section-number-3">1.12</span> Pre and Post Increment</h3>
<div class="outline-text-3" id="text-1-12">
<ul class="org-ul">
<li>x++ and ++x both eventually increment x but each does something different.</li>

<li>++x increments x and returns x's incremented value</li>

<li>x++ returns x and then increments x's value after.</li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span> = 0;
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);
    printf(<span style="color: #8b2252;">"++x ~ %d\n"</span>, ++x);
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);
    printf(<span style="color: #8b2252;">"x++ ~ %d\n"</span>, x++);
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
x = 0
++x ~ 1
x = 1
x++ ~ 1
x = 2

</pre>
</div>
