week02/presentation.txt


1.11 Boolean Values from Hazel
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

  [file:./bool.c]

  ,----
  | gcc -v -g -O0 -std=c99 -Wall -pedantic -o bool bool.c
  `----

  ,----
  | echo 2 | ./bool
  `----

  enter a number from 0-3: a is two (a_number < 2)=0 (a_number == 2)=1
  true=1 false=0 lt_two=0 (lt_two): false lt_two_int=0 (lt_two_int):
  false (1 `= true): 1 (2 =' true): 0 4 < a_number < 10: true (a_number
  < 2 ? 111 : 222)=222


  ,----
  | #include <stdbool.h>
  | #include <stdio.h>
  | #include <stdlib.h>
  | 
  | int main() {
  |     int a_number = -1;
  |     printf("enter a number from 0-3: ");
  |     int scanf_result = scanf("%d", &a_number);
  |     if (scanf_result != 1) {
  |         printf("Error: didn't read a number!\n");
  |         abort();
  |     }
  | 
  |     if (a_number < 2) {
  |         printf("a less than two\n");
  |     } else if (a_number == 2) {
  |         printf("a is two\n");
  |     } else {
  |         printf("a is greater than two\n");
  |     }
  | 
  |     printf("(a_number < 2)=%d\n", a_number < 2);
  | 
  |     printf("(a_number == 2)=%d\n", a_number == 2);
  | 
  |     // using true and false by name: be sure to include <stdbool.h>
  |     printf("true=%d\n", true);
  |     printf("false=%d\n", false);
  | 
  |     bool lt_two = a_number < 2;
  |     printf("lt_two=%d\n", lt_two);
  | 
  |     printf("(lt_two): ");
  |     if (lt_two) {
  |         printf("true\n");
  |     } else {
  |         printf("false\n");
  |     }
  | 
  |     int lt_two_int = a_number < 2;
  |     printf("lt_two_int=%d\n", lt_two_int);
  | 
  |     printf("(lt_two_int): ");
  |     if (lt_two_int) {
  |         printf("true\n");
  |     } else {
  |         printf("false\n");
  |     }
  | 
  |     // NEVER do == true, because any number that's not 0 is true.
  |     printf("(1 == true): %d\n", 1 == true);
  |     printf("(2 == true): %d\n", 2 == true);
  | 
  | 
  |     // to fix this 4 < a && a < 10
  |     printf("4 < a_number < 10: ");
  |     if ((4 < a_number) && (a_number < 10)) {
  |         printf("true\n");
  |     } else {
  |         printf("false\n");
  |     }
  |     int tmp = 0;
  |     if (a_number < 2) {
  |        tmp = 111;
  |     } else {
  |        tmp = 222;
  |     }
  |     tmp = (a_number < 2 ? 111 : 222);
  |     a_number < 2 ? tmp = 111 : tmp = 222;
  |     printf("(a_number < 2 ? 111 : 222)=%d\n", tmp);
  |     printf("(a_number < 2 ? 111 : 222)=%d\n", (a_number < 2 ? 111 : 222));
  |     (a_number < 2 ? 111 :((a_number < 1)? 000 : 222));
  |     return 0;
  | }
  `----


1.12 Pre and Post Increment
~~~~~~~~~~~~~~~~~~~~~~~~~~~

  - x++ and ++x both eventually increment x but each does something
    different.

  - ++x increments x and returns x's incremented value

  - x++ returns x and then increments x's value after.

  ,----
  | #include <stdio.h>
  | 
  | int main() {
  |     int x = 0;
  |     printf("x = %d\n", x);
  |     printf("++x ~ %d\n", ++x);
  |     printf("x = %d\n", x);
  |     printf("x++ ~ %d\n", x++);
  |     printf("x = %d\n", x);
  |     return 0;
  | }
  `----

  ,----
  | x = 0
  | ++x ~ 1
  | x = 1
  | x++ ~ 1
  | x = 2
  `----


1.12.1 Code for x++ and ++x
---------------------------

  ,----
  | #include <stdio.h>
  | 
  | int main() {
  |     int x = 0;
  |     printf("x = %d\n", x);
  |     // preincrement
  |     // ++x;
  |     x = x + 1;    
  |     printf("++x ~ %d\n", x);
  |     printf("x = %d\n", x);
  | 
  |     // postincrement
  |     // x++;
  |     int tmp = x;
  |     x = x + 1;
