week02/presentation.html

<div id="outline-container-org3162d46" class="outline-4">
<h4 id="org3162d46"><span class="section-number-4">1.12.1</span> Code for x++ and ++x</h4>
<div class="outline-text-4" id="text-1-12-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span> = 0;
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">preincrement</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">++x;</span>
    x = x + 1;    
    printf(<span style="color: #8b2252;">"++x ~ %d\n"</span>, x);
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);

    <span style="color: #b22222;">// </span><span style="color: #b22222;">postincrement</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">x++;</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tmp</span> = x;
    x = x + 1;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">note that our expression has changed from x++ to tmp because we return</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">the prior value of x and it is incremented afterwards</span>
    printf(<span style="color: #8b2252;">"x++ ~ %d\n"</span>, tmp);
    printf(<span style="color: #8b2252;">"x = %d\n"</span>, x);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
x = 0
++x ~ 1
x = 1
x++ ~ 1
x = 2

</pre>

<p>
<a href="./pre-post.c">./pre-post.c</a>
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span> = 100;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span> = x++;    
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">z</span> = ++x;
    <span style="color: #a020f0;">return</span> y;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh">gcc -v -g -O0 -std=c99 -Wall -pedantic -o pre-post pre-post.c
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc8b377c" class="outline-4">
<h4 id="orgc8b377c"><span class="section-number-4">1.12.2</span> Objdump it!</h4>
<div class="outline-text-4" id="text-1-12-2">
<div class="org-src-container">
<pre class="src src-sh">gcc -v -g -O0 -std=c99 -Wall -pedantic -o pre-post pre-post.c
objdump -d -S pre-post
</pre>
</div>
</div>
</div>
