week02/presentation.txt
  |     // note that our expression has changed from x++ to tmp because we return
  |     // the prior value of x and it is incremented afterwards
  |     printf("x++ ~ %d\n", tmp);
  |     printf("x = %d\n", x);
  |     return 0;
  | }
  `----

  ,----
  | x = 0
  | ++x ~ 1
  | x = 1
  | x++ ~ 1
  | x = 2
  `----

  [file:./pre-post.c]

  ,----
  | #include <stdio.h>
  | 
  | int main() {
  |     int x = 100;
  |     int y = x++;    
  |     int z = ++x;
  |     return y;
  | }
  `----

  ,----
  | gcc -v -g -O0 -std=c99 -Wall -pedantic -o pre-post pre-post.c
  `----


1.12.2 Objdump it!
------------------

  ,----
  | gcc -v -g -O0 -std=c99 -Wall -pedantic -o pre-post pre-post.c
  | objdump -d -S pre-post
  `----


1.12.3 Objdump Main
-------------------
