week02/presentation.org
*** Objdump Main
#+BEGIN_SRC verbatim
00000000000005fa <main>:
#include <stdio.h>

int main() {
5fa:	55                   	push   %rbp             # store main on the stack
 5fb:	48 89 e5             	mov    %rsp,%rbp        # move the stackpointer to rbp
    int x = 100;                                        
 5fe:	c7 45 f4 64 00 00 00 	movl   $0x64,-0xc(%rbp) # set x on the stack to 100
    int y = x++;
 605:	8b 45 f4             	mov    -0xc(%rbp),%eax  # copy x to eax
 608:	8d 50 01             	lea    0x1(%rax),%edx   # copy x+1 to edx (GCC why you abuse lea?!)
 60b:	89 55 f4             	mov    %edx,-0xc(%rbp)  # copy x+1 back to the stack as x
 60e:	89 45 f8             	mov    %eax,-0x8(%rbp)  # store old x from eax into where y is stored
    int z = ++x;
 611:	83 45 f4 01          	addl   $0x1,-0xc(%rbp)  # add 1 to x on the stack
 615:	8b 45 f4             	mov    -0xc(%rbp),%eax  # copy x from stack to eax
 618:	89 45 fc             	mov    %eax,-0x4(%rbp)  # store it into z
    return y;
 61b:	8b 45 f8             	mov    -0x8(%rbp),%eax  # copy y into eax to return
}
 61e:	5d                   	pop    %rbp             # restore base pointer
 61f:	c3                   	retq                    # return
#+END_SRC verbatim

** Comma Operator from Hazel

#+BEGIN_SRC C :exports both :flags "-std=c99 -Wall -pedantic"
#include <stdio.h>

/* The comma operator:
 * You should never use it in your own code!
 * It evaluates the expression on the left side of the comma, and discards the result.
 * Then it evaluates the expression on the right side. The value on the right side is the value of the expression.
 */

int main() {
    int an_int;
    int array[2] = { 100, 200 };
    // look at the inconsistency between an expression
    an_int = (1,2,3);
    printf("%d\n", an_int);
    // an a direct assignment (take the left most)
    an_int = 1,2,3;
    printf("%d\n", an_int);
    // first do (1,2) in expression order (take the right)
    // then do 2,3 in assignment order! (take the left)
    an_int = (1,2),3;
    printf("%d\n", an_int);
    printf("Don't rely on the comma operator!");
    return 0;
}
#+END_SRC

#+RESULTS:
: 3
: 1
: 2
: Don't rely on the comma operator!

** If statements

   if statements are of the form:

#+BEGIN_SRC C :eval no
   if ( condition ) {
      code for true case;
   }

   if ( condition ) {
      code for true case;
   } else {
      code for false case;
   }

   if ( condition ) {
      code for true case;
   } else if ( condition2 ) {
      code for !condition && condition2 case
   } else {
      code for false case;
   }

   &i // where my int is
   i & i // i and i
   i | i // i or i
   i ^ i // i xor i
   i && i // i logical and i
#+END_SRC


#+BEGIN_SRC C :exports both
#include <stdio.h>

int main(int argc, char**argv) {

   int input = 0;
   int condition =  input > 1;
   int condition2 = input == 1;
   int condition3 = input > 0;

   if ( condition ) {
      printf("if code for true case\n");
   }

   if ( condition ) {
      printf("if-else code for true case\n");
   } else {
      printf("if-else code for false case\n");
   }

   if ( condition ) {
      printf("if-else-if-else code for condition is true case\n");
   } else if ( condition2 ) {
      printf("if-else-if-else code for !condition && condition2 case\n");
   } else {
      printf("if-else-if-else code for !condition && !condition2 case\n");
   }

   if (condition) {
      printf("parallel-ifs condition!\n");
   }
   if (condition2) {
      printf("parallel-ifs condition2!\n");
   }
   if (condition3) {
      printf("parallel-ifs condition3!\n");
   }

    return 0;
}
#+END_SRC

#+RESULTS:
: if-else code for false case
: if-else-if-else code for !condition && !condition2 case

