week02/presentation.html


<div id="outline-container-orgba556ad" class="outline-4">
<h4 id="orgba556ad"><span class="section-number-4">1.12.3</span> Objdump Main</h4>
<div class="outline-text-4" id="text-1-12-3">
<p>
#+BEGIN<sub>SRC</sub> verbatim
00000000000005fa &lt;main&gt;:
#include &lt;stdio.h&gt;
</p>

<p>
int main() {
5fa:	55                   	push   %rbp             # store main on the stack
 5fb:	48 89 e5             	mov    %rsp,%rbp        # move the stackpointer to rbp
    int x = 100;                                        
 5fe:	c7 45 f4 64 00 00 00 	movl   $0x64,-0xc(%rbp) # set x on the stack to 100
    int y = x++;
 605:	8b 45 f4             	mov    -0xc(%rbp),%eax  # copy x to eax
 608:	8d 50 01             	lea    0x1(%rax),%edx   # copy x+1 to edx (GCC why you abuse lea?!)
 60b:	89 55 f4             	mov    %edx,-0xc(%rbp)  # copy x+1 back to the stack as x
 60e:	89 45 f8             	mov    %eax,-0x8(%rbp)  # store old x from eax into where y is stored
    int z = ++x;
 611:	83 45 f4 01          	addl   $0x1,-0xc(%rbp)  # add 1 to x on the stack
 615:	8b 45 f4             	mov    -0xc(%rbp),%eax  # copy x from stack to eax
 618:	89 45 fc             	mov    %eax,-0x4(%rbp)  # store it into z
    return y;
 61b:	8b 45 f8             	mov    -0x8(%rbp),%eax  # copy y into eax to return
}
 61e:	5d                   	pop    %rbp             # restore base pointer
 61f:	c3                   	retq                    # return
#+END<sub>SRC</sub> verbatim
</p>
</div>
</div>
</div>

<div id="outline-container-org0e8dd26" class="outline-3">
<h3 id="org0e8dd26"><span class="section-number-3">1.13</span> Comma Operator from Hazel</h3>
<div class="outline-text-3" id="text-1-13">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #b22222;">/* </span><span style="color: #b22222;">The comma operator:</span>
<span style="color: #b22222;"> * You should never use it in your own code!</span>
<span style="color: #b22222;"> * It evaluates the expression on the left side of the comma, and discards the result.</span>
<span style="color: #b22222;"> * Then it evaluates the expression on the right side. The value on the right side is the value of the expression.</span>
<span style="color: #b22222;"> </span><span style="color: #b22222;">*/</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span>;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">array</span>[2] = { 100, 200 };
    <span style="color: #b22222;">// </span><span style="color: #b22222;">look at the inconsistency between an expression</span>
    an_int = (1,2,3);
    printf(<span style="color: #8b2252;">"%d\n"</span>, an_int);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">an a direct assignment (take the left most)</span>
    an_int = 1,2,3;
    printf(<span style="color: #8b2252;">"%d\n"</span>, an_int);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">first do (1,2) in expression order (take the right)</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">then do 2,3 in assignment order! (take the left)</span>
    an_int = (1,2),3;
    printf(<span style="color: #8b2252;">"%d\n"</span>, an_int);
    printf(<span style="color: #8b2252;">"Don't rely on the comma operator!"</span>);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
3
1
2
Don't rely on the comma operator!

</pre>
</div>
</div>

<div id="outline-container-org3250418" class="outline-3">
<h3 id="org3250418"><span class="section-number-3">1.14</span> If statements</h3>
<div class="outline-text-3" id="text-1-14">
<p>
if statements are of the form:
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #a020f0;">if</span> ( condition ) {
   code <span style="color: #a020f0;">for</span> <span style="color: #008b8b;">true</span> <span style="color: #a020f0;">case</span>;
}

<span style="color: #a020f0;">if</span> ( condition ) {
   code <span style="color: #a020f0;">for</span> <span style="color: #008b8b;">true</span> <span style="color: #a020f0;">case</span>;
} <span style="color: #a020f0;">else</span> {
   code <span style="color: #a020f0;">for</span> <span style="color: #008b8b;">false</span> <span style="color: #a020f0;">case</span>;
}

<span style="color: #a020f0;">if</span> ( condition ) {
   code <span style="color: #a020f0;">for</span> <span style="color: #008b8b;">true</span> <span style="color: #a020f0;">case</span>;
} <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> ( condition2 ) {
   code <span style="color: #a020f0;">for</span> !condition &amp;&amp; condition2 <span style="color: #a020f0;">case</span>
} <span style="color: #a020f0;">else</span> {
   code <span style="color: #a020f0;">for</span> <span style="color: #008b8b;">false</span> <span style="color: #a020f0;">case</span>;
}

&amp;i <span style="color: #b22222;">// </span><span style="color: #b22222;">where my int is</span>
i &amp; i <span style="color: #b22222;">// </span><span style="color: #b22222;">i and i</span>
i | i <span style="color: #b22222;">// </span><span style="color: #b22222;">i or i</span>
i ^ i <span style="color: #b22222;">// </span><span style="color: #b22222;">i xor i</span>
i &amp;&amp; i <span style="color: #b22222;">// </span><span style="color: #b22222;">i logical and i</span>
</pre>
</div>


<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {

   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">input</span> = 0;
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">condition</span> =  input &gt; 1;
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">condition2</span> = input == 1;
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">condition3</span> = input &gt; 0;

   <span style="color: #a020f0;">if</span> ( condition ) {
      printf(<span style="color: #8b2252;">"if code for true case\n"</span>);
   }

   <span style="color: #a020f0;">if</span> ( condition ) {
      printf(<span style="color: #8b2252;">"if-else code for true case\n"</span>);
   } <span style="color: #a020f0;">else</span> {
      printf(<span style="color: #8b2252;">"if-else code for false case\n"</span>);
   }

   <span style="color: #a020f0;">if</span> ( condition ) {
      printf(<span style="color: #8b2252;">"if-else-if-else code for condition is true case\n"</span>);
   } <span style="color: #a020f0;">else</span> <span style="color: #a020f0;">if</span> ( condition2 ) {
      printf(<span style="color: #8b2252;">"if-else-if-else code for !condition &amp;&amp; condition2 case\n"</span>);
   } <span style="color: #a020f0;">else</span> {
      printf(<span style="color: #8b2252;">"if-else-if-else code for !condition &amp;&amp; !condition2 case\n"</span>);
   }

   <span style="color: #a020f0;">if</span> (condition) {
      printf(<span style="color: #8b2252;">"parallel-ifs condition!\n"</span>);
   }
   <span style="color: #a020f0;">if</span> (condition2) {
      printf(<span style="color: #8b2252;">"parallel-ifs condition2!\n"</span>);
   }
   <span style="color: #a020f0;">if</span> (condition3) {
      printf(<span style="color: #8b2252;">"parallel-ifs condition3!\n"</span>);
   }

    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
if-else code for false case
if-else-if-else code for !condition &amp;&amp; !condition2 case

</pre>
</div>
</div>
