week02/presentation.html

<div id="outline-container-orgdd8ae6e" class="outline-3">
<h3 id="orgdd8ae6e"><span class="section-number-3">1.15</span> Blocks! from Hazel</h3>
<div class="outline-text-3" id="text-1-15">
<p>
Block are chunks of code that are related or grouped together by
the parser and compiler. The code that is executed on the else
statement of an if is a block.
</p>

<p>
Many C statements like if do not need { } braces for blocks
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">some_num</span> = 3;

    <span style="color: #b22222;">// </span><span style="color: #b22222;">mildly confusing syntax</span>
    printf(<span style="color: #8b2252;">"Will print 0 if 0 is true:\n"</span>);
    <span style="color: #a020f0;">if</span> (0) printf(<span style="color: #8b2252;">"0\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">printf("the real false 0\n");</span>

    <span style="color: #b22222;">// </span><span style="color: #b22222;">more confusing syntax    </span>
    printf(<span style="color: #8b2252;">"Will print 1 if 1 is true:\n"</span>);
    <span style="color: #a020f0;">if</span> (1)
        printf(<span style="color: #8b2252;">"1\n"</span>);
    printf(<span style="color: #8b2252;">"the real true 1\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">really confusing syntax    </span>
    <span style="color: #a020f0;">if</span> (2) printf(<span style="color: #8b2252;">"2 is true\n"</span>);
    <span style="color: #a020f0;">else</span> printf(<span style="color: #8b2252;">"2 is false\n"</span>);

    printf(<span style="color: #8b2252;">"------------------------------\n"</span>);

    <span style="color: #b22222;">// </span><span style="color: #b22222;">good syntax! Do this! Use braces!</span>
    printf(<span style="color: #8b2252;">"outside of if some_num=%d\n"</span>, some_num);
    <span style="color: #a020f0;">if</span> (1) {
        <span style="color: #228b22;">int</span> <span style="color: #a0522d;">some_num</span> = 2;
        printf(<span style="color: #8b2252;">"inside of if some_num=%d\n"</span>, some_num);
    }
    printf(<span style="color: #8b2252;">"outside of if some_num=%d\n"</span>, some_num);

    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
Will print 0 if 0 is true:
Will print 1 if 1 is true:
1
the real true 1
2 is true
------------------------------
outside of if some_num=3
inside of if some_num=2
outside of if some_num=3

</pre>
</div>
</div>


<div id="outline-container-orgd9280b4" class="outline-3">
<h3 id="orgd9280b4"><span class="section-number-3">1.16</span> Ternary Statements</h3>
<div class="outline-text-3" id="text-1-16">
<p>
An if statement that is an expression!
</p>

<p>
( condition ) ? ( true expression ) : ( false expression )
</p>

<p>
Only use 1 ternary at a time. More is confusing.
</p>

<p>
<i>/ don't do this
/</i> (condition &gt; 0) * (true expression) + (condition == 0) * (false expression)
</p>

<p>
int functionName(int xx) {
   int x = (xx == 0)?16:xx;
}
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">a_number</span> = 0;
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">tmp</span> = (a_number &lt; 2 ? 111 : 222);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">don't do this</span>
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">res</span> = a_number &lt; 2 ? (tmp = 111) : (tmp = 222);
    printf(<span style="color: #8b2252;">"res = a_number &lt; 2 ? tmp = 111 : tmp = 222? res = %d\n"</span>, res);
    printf(<span style="color: #8b2252;">"(a_number &lt; 2 ? 111 : 222)=%d\n"</span>, tmp);
    printf(<span style="color: #8b2252;">"(a_number &lt; 2 ? 111 : 222)=%d\n"</span>, (a_number &lt; 2 ? 111 : 222));
    printf(<span style="color: #8b2252;">"An expression? %d\n"</span>, (a_number &lt; 2 ? 111 :((a_number &lt; 1)? 000 : 222)));
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
res = a_number &lt; 2 ? tmp = 111 : tmp = 222? res = 111
(a_number &lt; 2 ? 111 : 222)=111
(a_number &lt; 2 ? 111 : 222)=111
An expression? 111

</pre>
</div>
</div>
