week02/presentation.txt


1.15 Blocks! from Hazel
~~~~~~~~~~~~~~~~~~~~~~~

  Block are chunks of code that are related or grouped together by the
  parser and compiler. The code that is executed on the else statement
  of an if is a block.

  Many C statements like if do not need { } braces for blocks

  ,----
  | #include <stdio.h>
  | #include <stdlib.h>
  | #include <string.h>
  | 
  | int main() {
  |     int some_num = 3;
  | 
  |     // mildly confusing syntax
  |     printf("Will print 0 if 0 is true:\n");
  |     if (0) printf("0\n");
  |     // printf("the real false 0\n");
  | 
  |     // more confusing syntax    
  |     printf("Will print 1 if 1 is true:\n");
  |     if (1)
  |         printf("1\n");
  |     printf("the real true 1\n");
  |     // really confusing syntax    
  |     if (2) printf("2 is true\n");
  |     else printf("2 is false\n");
  | 
  |     printf("------------------------------\n");
  | 
  |     // good syntax! Do this! Use braces!
  |     printf("outside of if some_num=%d\n", some_num);
  |     if (1) {
  |         int some_num = 2;
  |         printf("inside of if some_num=%d\n", some_num);
  |     }
  |     printf("outside of if some_num=%d\n", some_num);
  | 
  |     return 0;
  | }
  `----

  ,----
  | Will print 0 if 0 is true:
  | Will print 1 if 1 is true:
  | 1
  | the real true 1
  | 2 is true
  | ------------------------------
  | outside of if some_num=3
  | inside of if some_num=2
  | outside of if some_num=3
  `----


1.16 Ternary Statements
~~~~~~~~~~~~~~~~~~~~~~~

  An if statement that is an expression!

  ( condition ) ? ( true expression ) : ( false expression )

  Only use 1 ternary at a time. More is confusing.

  // don't do this // (condition > 0) * (true expression) + (condition
  == 0) * (false expression)

  int functionName(int xx) { int x = (xx == 0)?16:xx; }

  ,----
  | #include <stdio.h>
  | 
  | int main(int argc, char**argv) {
  |     int a_number = 0;
  |     int tmp = (a_number < 2 ? 111 : 222);
  |     // don't do this
  |     int res = a_number < 2 ? (tmp = 111) : (tmp = 222);
  |     printf("res = a_number < 2 ? tmp = 111 : tmp = 222? res = %d\n", res);
  |     printf("(a_number < 2 ? 111 : 222)=%d\n", tmp);
  |     printf("(a_number < 2 ? 111 : 222)=%d\n", (a_number < 2 ? 111 : 222));
  |     printf("An expression? %d\n", (a_number < 2 ? 111 :((a_number < 1)? 000 : 222)));
  |     return 0;
  | }
  `----

  ,----
  | res = a_number < 2 ? tmp = 111 : tmp = 222? res = 111
  | (a_number < 2 ? 111 : 222)=111
  | (a_number < 2 ? 111 : 222)=111
  | An expression? 111
  `----


1.17 Switch Statements
~~~~~~~~~~~~~~~~~~~~~~
