week02/presentation.org
** Switch Statements

Switch statement operators on values and matches values directly. If
you use it with strings it will surprise you and not work as expected.
Use it on characters, bools, ints. Try not to use it on floats.

#+BEGIN_SRC C :exports both
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    char direction = 'u';
    switch(direction) {
        case 'u':
        case 'U':
            printf("Up\n");
            break;
        case 'D':
            printf("Down\n");
            break;
        case 'L':
            printf("Left\n"); // bug here
        case 'R':
            printf("Right\n");
            break;
        default:
            printf("Direction is invalid");
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: Up

#+BEGIN_SRC C :exports both
// Copyright (c) 2020 Hazel Campbell
// Licensed under AGPL3.0+
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    char depth = 2;
    switch(depth) {
        case 0:
            printf("0\n");
        case 1:
            printf("1111\n");
        case 2:
            printf("22222222\n");
        case 3:
            printf("333333333333\n");
        case 4:
            printf("4444444444444444\n");
            break;
        default:
            printf("Too big or too small");
    }
    return 0;
}
#+END_SRC

#+RESULTS:
: 22222222
: 333333333333
: 4444444444444444




** Switch Statements [code from Hazel]

file:./switch.c
#+BEGIN_SRC sh :exports both
   gcc -v -g -O0 -std=c99 -Wall -pedantic -o switch switch.c
#+END_SRC

#+RESULTS:

#+BEGIN_SRC sh :exports both 
   echo input  1
   echo 1 | ./switch
   echo input  2
   echo 2 | ./switch
   echo input  3
   echo 3 | ./switch
   echo input  4
   echo 4 | ./switch
   echo input  5
   echo 5 | ./switch
#+END_SRC

#+RESULTS:
#+begin_example
input 1
enter number number from 0-3: one
input 2
enter number number from 0-3: two
two or three
input 3
enter number number from 0-3: two or three
input 4
enter number number from 0-3: not a number from 0-3
input 5
enter number number from 0-3: not a number from 0-3
#+end_example



#+BEGIN_SRC C :exports both
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    int number = -1;
    printf("enter number number from 0-3: ");
    int scanned = scanf("%d", &number);
    if (scanned != 1) {
        printf("Eh?\n");
        abort();
    }
    switch(number) {
        case 0:
            printf("zero\n");
            break;
        case 1:
            printf("one\n");
            break;
        case 2:
            printf("two\n");
        case 3:
            printf("two or three\n");
            break;
        default:
            printf("not a number from 0-3\n");
    }
    return 0;
}
#+END_SRC

#+RESULTS:

** While loops
#+BEGIN_SRC C :exports both
#include <stdio.h>

int main(int argc, char**argv) {
    return 0;
}
#+END_SRC

#+RESULTS:

