week02/presentation.html

<div id="outline-container-org23a5063" class="outline-3">
<h3 id="org23a5063"><span class="section-number-3">1.17</span> Switch Statements</h3>
<div class="outline-text-3" id="text-1-17">
<p>
Switch statement operators on values and matches values directly. If
you use it with strings it will surprise you and not work as expected.
Use it on characters, bools, ints. Try not to use it on floats.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">direction</span> = <span style="color: #8b2252;">'u'</span>;
    <span style="color: #a020f0;">switch</span>(direction) {
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'u'</span>:
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'U'</span>:
            printf(<span style="color: #8b2252;">"Up\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'D'</span>:
            printf(<span style="color: #8b2252;">"Down\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'L'</span>:
            printf(<span style="color: #8b2252;">"Left\n"</span>); <span style="color: #b22222;">// </span><span style="color: #b22222;">bug here</span>
        <span style="color: #a020f0;">case</span> <span style="color: #8b2252;">'R'</span>:
            printf(<span style="color: #8b2252;">"Right\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">default</span>:
            printf(<span style="color: #8b2252;">"Direction is invalid"</span>);
    }
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
Up

</pre>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Licensed under AGPL3.0+</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">char</span> <span style="color: #a0522d;">depth</span> = 2;
    <span style="color: #a020f0;">switch</span>(depth) {
        <span style="color: #a020f0;">case</span> 0:
            printf(<span style="color: #8b2252;">"0\n"</span>);
        <span style="color: #a020f0;">case</span> 1:
            printf(<span style="color: #8b2252;">"1111\n"</span>);
        <span style="color: #a020f0;">case</span> 2:
            printf(<span style="color: #8b2252;">"22222222\n"</span>);
        <span style="color: #a020f0;">case</span> 3:
            printf(<span style="color: #8b2252;">"333333333333\n"</span>);
        <span style="color: #a020f0;">case</span> 4:
            printf(<span style="color: #8b2252;">"4444444444444444\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">default</span>:
            printf(<span style="color: #8b2252;">"Too big or too small"</span>);
    }
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
22222222
333333333333
4444444444444444

</pre>
</div>
</div>




<div id="outline-container-orgef123c1" class="outline-3">
<h3 id="orgef123c1"><span class="section-number-3">1.18</span> Switch Statements [code from Hazel]</h3>
<div class="outline-text-3" id="text-1-18">
<p>
<a href="./switch.c">./switch.c</a>
</p>
<div class="org-src-container">
<pre class="src src-sh">gcc -v -g -O0 -std=c99 -Wall -pedantic -o switch switch.c
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #483d8b;">echo</span> input  1
<span style="color: #483d8b;">echo</span> 1 | ./switch
<span style="color: #483d8b;">echo</span> input  2
<span style="color: #483d8b;">echo</span> 2 | ./switch
<span style="color: #483d8b;">echo</span> input  3
<span style="color: #483d8b;">echo</span> 3 | ./switch
<span style="color: #483d8b;">echo</span> input  4
<span style="color: #483d8b;">echo</span> 4 | ./switch
<span style="color: #483d8b;">echo</span> input  5
<span style="color: #483d8b;">echo</span> 5 | ./switch
</pre>
</div>

<pre class="example">
input 1
enter number number from 0-3: one
input 2
enter number number from 0-3: two
two or three
input 3
enter number number from 0-3: two or three
input 4
enter number number from 0-3: not a number from 0-3
input 5
enter number number from 0-3: not a number from 0-3
</pre>



<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">number</span> = -1;
    printf(<span style="color: #8b2252;">"enter number number from 0-3: "</span>);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">scanned</span> = scanf(<span style="color: #8b2252;">"%d"</span>, &amp;number);
    <span style="color: #a020f0;">if</span> (scanned != 1) {
        printf(<span style="color: #8b2252;">"Eh?\n"</span>);
        abort();
    }
    <span style="color: #a020f0;">switch</span>(number) {
        <span style="color: #a020f0;">case</span> 0:
            printf(<span style="color: #8b2252;">"zero\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> 1:
            printf(<span style="color: #8b2252;">"one\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">case</span> 2:
            printf(<span style="color: #8b2252;">"two\n"</span>);
        <span style="color: #a020f0;">case</span> 3:
            printf(<span style="color: #8b2252;">"two or three\n"</span>);
            <span style="color: #a020f0;">break</span>;
        <span style="color: #a020f0;">default</span>:
            printf(<span style="color: #8b2252;">"not a number from 0-3\n"</span>);
    }
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>
