week02/presentation.org
** For loops

#+BEGIN_SRC C :eval no :exports src

   for ( init_condition; looping_condition ; runs_each_time )

   // Loop from 0 to 10
   for ( int i = 0 ; i <= 10 ; i++ ) 
   for ( int i = 0 ; i <= 10 ; i+=1 ) 
   for ( int i = 0 ; i <= 10 ; ++i ) 

#+END_SRC

#+BEGIN_SRC C :exports both
#include <stdio.h>

int main() {
   //int i = 0;
   printf("i++\n");
   for ( int i = 0 ; i < 10 ; i++ ) {
       printf("%d ", i);
   }
   // printf("i %d", i); // i is undeclared in this scope!
   printf("\ni+=1\n");
   for ( int i = 0 ; i < 10 ; i+=1 )  {
       printf("%d ", i);
   }
   printf("\n++i\n");
   for ( int i = 0 ; i < 10 ; ++i )  {
       printf("%d ", i);
   }
   printf("\ni+=3\n");
   int i = 0;
   for ( i = 0 ; i < 10 ; i+=3 )  {
       printf("%d ", i);
   }
   printf("\ni left behind %d\n", i);
   return 0;
}
#+END_SRC

#+RESULTS:
: i++
: 0 1 2 3 4 5 6 7 8 9 
: i+=1
: 0 1 2 3 4 5 6 7 8 9 
: ++i
: 0 1 2 3 4 5 6 7 8 9 
: i+=3
: 0 3 6 9 
: i left behind 12


*** Idiomatic For Loops

Here's how you write good for loops in C99

#+BEGIN_SRC C :exports both
// Copyright (c) 2020 Hazel Campbell
// Licensed under the AGPL3.0+
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

int main() {
    int count_to = 4;
    // Counting from 0 to count_to-1 (3)
    for (int counter = 0; counter < count_to; counter++) {
        printf("%d ", counter);
    }
    printf("\n");
    // Counting from 1 to count_to (4)
    for (int counter = 1; counter <= count_to; counter++) {
        printf("%d ", counter);
    }
    printf("\n");
    // Counting from count_to-1 to 0
    for (int counter = count_to-1; counter >= 0; counter--) {
        printf("%d ", counter);
    }
    printf("\n");
    // Counting from count_to to 1
    for (int counter = count_to; counter >= 1; counter--) {
        printf("%d ", counter);
    }
    printf("\n");
    return 0;
}
#+END_SRC

#+RESULTS:
: 0 1 2 3 
: 1 2 3 4 
: 3 2 1 0 
: 4 3 2 1

