week02/presentation.html

<div id="outline-container-org2db431b" class="outline-3">
<h3 id="org2db431b"><span class="section-number-3">1.19</span> While loops</h3>
<div class="outline-text-3" id="text-1-19">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span>**<span style="color: #a0522d;">argv</span>) {
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org43672a0" class="outline-3">
<h3 id="org43672a0"><span class="section-number-3">1.20</span> For loops</h3>
<div class="outline-text-3" id="text-1-20">
<div class="org-src-container">
<pre class="src src-C">
<span style="color: #a020f0;">for</span> ( init_condition; looping_condition ; runs_each_time )

<span style="color: #b22222;">// </span><span style="color: #b22222;">Loop from 0 to 10</span>
<span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt;= 10 ; i++ ) 
<span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt;= 10 ; i+=1 ) 
<span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt;= 10 ; ++i ) 

</pre>
</div>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
   <span style="color: #b22222;">//</span><span style="color: #b22222;">int i = 0;</span>
   printf(<span style="color: #8b2252;">"i++\n"</span>);
   <span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 10 ; i++ ) {
       printf(<span style="color: #8b2252;">"%d "</span>, i);
   }
   <span style="color: #b22222;">// </span><span style="color: #b22222;">printf("i %d", i); // i is undeclared in this scope!</span>
   printf(<span style="color: #8b2252;">"\ni+=1\n"</span>);
   <span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 10 ; i+=1 )  {
       printf(<span style="color: #8b2252;">"%d "</span>, i);
   }
   printf(<span style="color: #8b2252;">"\n++i\n"</span>);
   <span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0 ; i &lt; 10 ; ++i )  {
       printf(<span style="color: #8b2252;">"%d "</span>, i);
   }
   printf(<span style="color: #8b2252;">"\ni+=3\n"</span>);
   <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0;
   <span style="color: #a020f0;">for</span> ( i = 0 ; i &lt; 10 ; i+=3 )  {
       printf(<span style="color: #8b2252;">"%d "</span>, i);
   }
   printf(<span style="color: #8b2252;">"\ni left behind %d\n"</span>, i);
   <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
i++
0 1 2 3 4 5 6 7 8 9 
i+=1
0 1 2 3 4 5 6 7 8 9 
++i
0 1 2 3 4 5 6 7 8 9 
i+=3
0 3 6 9 
i left behind 12

</pre>
</div>


<div id="outline-container-orgf0a17f0" class="outline-4">
<h4 id="orgf0a17f0"><span class="section-number-4">1.20.1</span> Idiomatic For Loops</h4>
<div class="outline-text-4" id="text-1-20-1">
<p>
Here's how you write good for loops in C99
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Licensed under the AGPL3.0+</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count_to</span> = 4;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Counting from 0 to count_to-1 (3)</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span> = 0; counter &lt; count_to; counter++) {
        printf(<span style="color: #8b2252;">"%d "</span>, counter);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Counting from 1 to count_to (4)</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span> = 1; counter &lt;= count_to; counter++) {
        printf(<span style="color: #8b2252;">"%d "</span>, counter);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Counting from count_to-1 to 0</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span> = count_to-1; counter &gt;= 0; counter--) {
        printf(<span style="color: #8b2252;">"%d "</span>, counter);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">Counting from count_to to 1</span>
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span> = count_to; counter &gt;= 1; counter--) {
        printf(<span style="color: #8b2252;">"%d "</span>, counter);
    }
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
0 1 2 3 
1 2 3 4 
3 2 1 0 
4 3 2 1

</pre>
</div>
</div>
