week02/presentation.html

<div id="outline-container-orge65360c" class="outline-4">
<h4 id="orge65360c"><span class="section-number-4">1.20.2</span> Hazel's Gallery of Misfit For Loops</h4>
<div class="outline-text-4" id="text-1-20-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Licensed under AGPL3.0+</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">COUNT_TO</span> 5

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span>;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">clear idiomatic for loop!</span>
    <span style="color: #a020f0;">for</span> (counter = 0; counter &lt; COUNT_TO; counter++) {
        printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
    }
    printf(<span style="color: #8b2252;">"---\n"</span>);
    counter = 0;
    <span style="color: #b22222;">// </span><span style="color: #b22222;">while loop that does the same thing :/</span>
    <span style="color: #a020f0;">while</span> (counter &lt; COUNT_TO) {
        printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
        counter++;
    }
    printf(<span style="color: #8b2252;">"---\n"</span>);
    printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
    <span style="color: #b22222;">// </span><span style="color: #b22222;">for (</span>
    <span style="color: #b22222;">//  </span><span style="color: #b22222;">something that runs once ;</span>
    <span style="color: #b22222;">//  </span><span style="color: #b22222;">counter conditional that's checked </span>
    <span style="color: #b22222;">//      </span><span style="color: #b22222;">each time;</span>
    <span style="color: #b22222;">//  </span><span style="color: #b22222;">something that happens each time ;</span>
    <span style="color: #b22222;">// </span><span style="color: #b22222;">)</span>
    printf(<span style="color: #8b2252;">"---\n"</span>);
    counter = 0;
    <span style="color: #a020f0;">for</span> (; counter &lt; COUNT_TO; counter++) {
        printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
    }
    printf(<span style="color: #8b2252;">"---\n"</span>);
    counter = 0;
    <span style="color: #a020f0;">for</span> (; counter &lt; COUNT_TO; counter++) {
        printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
        counter = COUNT_TO;
    }
    printf(<span style="color: #8b2252;">"---\n"</span>);
    printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
    printf(<span style="color: #8b2252;">"---\n"</span>);
    counter = 0;
    <span style="color: #a020f0;">for</span> (; counter &lt; COUNT_TO;) {
        printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
        counter = COUNT_TO;
    }
    <span style="color: #a020f0;">for</span> (;;) {
       <span style="color: #b22222;">// </span><span style="color: #b22222;">infinite loop here</span>
       <span style="color: #a020f0;">break</span>;
    }
    printf(<span style="color: #8b2252;">"---\n"</span>);
    printf(<span style="color: #8b2252;">"%d\n"</span>, counter);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
0
1
2
3
4
---
0
1
2
3
4
---
5
---
0
1
2
3
4
---
0
---
6
---
0
---
5
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ce9397" class="outline-3">
<h3 id="org3ce9397"><span class="section-number-3">1.21</span> Break and For</h3>
<div class="outline-text-3" id="text-1-21">
<p>
The break statement allows you to quit the immediate for loop or while
loop you are in.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Licensed under AGPL3.0+</span>

<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count_to</span> = 4;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; count_to; i++) {
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span> = 0; j &lt; count_to; j++) {
            <span style="color: #a020f0;">if</span> (i+j == count_to) {
                <span style="color: #a020f0;">break</span>;
            }
            printf(<span style="color: #8b2252;">"%d "</span>, i+j);
        }
        printf(<span style="color: #8b2252;">"\n"</span>);
    }
}
</pre>
</div>

<pre class="example">
0 1 2 3 
1 2 3 
2 3 
3

</pre>
</div>

<div id="outline-container-orgf1e550c" class="outline-4">
<h4 id="orgf1e550c"><span class="section-number-4">1.21.1</span> Continue</h4>
<div class="outline-text-4" id="text-1-21-1">
<p>
Continue is like break except it skips the loop body to the end and
restarts.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #b22222;">// </span><span style="color: #b22222;">Licensed under AGPL3.0+</span>

<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">count_to</span> = 4;
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 0; i &lt; count_to; i++) {
        <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">j</span> = 0; j &lt; count_to; j++) {
            <span style="color: #a020f0;">if</span> (i+j == count_to) {
                <span style="color: #a020f0;">continue</span>;
            }
            printf(<span style="color: #8b2252;">"%d "</span>, i+j);
        }
        printf(<span style="color: #8b2252;">"\n"</span>);
    }
}
</pre>
</div>

<pre class="example">
0 1 2 3 
1 2 3 
2 3 5 
3 5 6

</pre>
</div>
</div>
</div>
