week02/presentation.txt


1.20.2 Hazel's Gallery of Misfit For Loops
------------------------------------------

  ,----
  | // Copyright (c) 2020 Hazel Campbell
  | // Licensed under AGPL3.0+
  | #include <stdio.h>
  | #include <stdlib.h>
  | #include <string.h>
  | 
  | #define COUNT_TO 5
  | 
  | int main() {
  |     int counter;
  |     // clear idiomatic for loop!
  |     for (counter = 0; counter < COUNT_TO; counter++) {
  |         printf("%d\n", counter);
  |     }
  |     printf("---\n");
  |     counter = 0;
  |     // while loop that does the same thing :/
  |     while (counter < COUNT_TO) {
  |         printf("%d\n", counter);
  |         counter++;
  |     }
  |     printf("---\n");
  |     printf("%d\n", counter);
  |     // for (
  |     //  something that runs once ;
  |     //  counter conditional that's checked 
  |     //      each time;
  |     //  something that happens each time ;
  |     // )
  |     printf("---\n");
  |     counter = 0;
  |     for (; counter < COUNT_TO; counter++) {
  |         printf("%d\n", counter);
  |     }
  |     printf("---\n");
  |     counter = 0;
  |     for (; counter < COUNT_TO; counter++) {
  |         printf("%d\n", counter);
  |         counter = COUNT_TO;
  |     }
  |     printf("---\n");
  |     printf("%d\n", counter);
  |     printf("---\n");
  |     counter = 0;
  |     for (; counter < COUNT_TO;) {
  |         printf("%d\n", counter);
  |         counter = COUNT_TO;
  |     }
  |     for (;;) {
  |        // infinite loop here
  |        break;
  |     }
  |     printf("---\n");
  |     printf("%d\n", counter);
  |     return 0;
  | }
  `----

  ,----
  | 0
  | 1
  | 2
  | 3
  | 4
  | ---
  | 0
  | 1
  | 2
  | 3
  | 4
  | ---
  | 5
  | ---
  | 0
  | 1
  | 2
  | 3
  | 4
  | ---
  | 0
  | ---
  | 6
  | ---
  | 0
  | ---
  | 5
  `----


1.21 Break and For
~~~~~~~~~~~~~~~~~~

  The break statement allows you to quit the immediate for loop or while
  loop you are in.

  ,----
  | // Copyright (c) 2020 Hazel Campbell
  | // Licensed under AGPL3.0+
  | 
  | #include <stdio.h>
  | 
  | int main() {
  |     int count_to = 4;
  |     for (int i = 0; i < count_to; i++) {
  |         for (int j = 0; j < count_to; j++) {
  |             if (i+j == count_to) {
  |                 break;
  |             }
  |             printf("%d ", i+j);
  |         }
  |         printf("\n");
  |     }
  | }
  `----

  ,----
  | 0 1 2 3 
  | 1 2 3 
  | 2 3 
  | 3
  `----


1.21.1 Continue
---------------

  Continue is like break except it skips the loop body to the end and
  restarts.

  ,----
  | // Copyright (c) 2020 Hazel Campbell
  | // Licensed under AGPL3.0+
  | 
  | #include <stdio.h>
  | 
  | int main() {
  |     int count_to = 4;
  |     for (int i = 0; i < count_to; i++) {
  |         for (int j = 0; j < count_to; j++) {
  |             if (i+j == count_to) {
  |                 continue;
  |             }
  |             printf("%d ", i+j);
  |         }
  |         printf("\n");
  |     }
  | }
  `----

  ,----
  | 0 1 2 3 
  | 1 2 3 
  | 2 3 5 
  | 3 5 6
  `----


1.22 GOTO
~~~~~~~~~
