week02/presentation.html

<div id="outline-container-orgaa7426e" class="outline-3">
<h3 id="orgaa7426e"><span class="section-number-3">1.22</span> GOTO</h3>
<div class="outline-text-3" id="text-1-22">
<p>
GOTO is basically our jmp opcode from assembler except we can only go to labels.
</p>

<p>
labels in code are an identifier followed by a colon:
</p>

<p>
If you have -g flags in gcc the label will be in executable, otherwise
it will just be an offset that you jump to.
</p>

<p>
GOTOs can only be in the same function in C.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">super</span>;
    <span style="color: #008b8b;">ala</span>:
    printf(<span style="color: #8b2252;">"Aladocious\n"</span>); 
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">end</span>;
    <span style="color: #008b8b;">expi</span>:
    printf(<span style="color: #8b2252;">"Expi\n"</span>);
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">ala</span>;
    <span style="color: #008b8b;">fragi</span>:
    printf(<span style="color: #8b2252;">"Fragilistic\n"</span>);
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">expi</span>;
    <span style="color: #008b8b;">cali</span>:
    printf(<span style="color: #8b2252;">"Cali\n"</span>);    
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">fragi</span>;
    <span style="color: #008b8b;">super</span>:
    printf(<span style="color: #8b2252;">"Super\n"</span>);    
    <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">cali</span>;
    <span style="color: #008b8b;">end</span>:
    printf(<span style="color: #8b2252;">"Done! Don't use GOTOs!"</span>);
}

</pre>
</div>

<pre class="example">
Super
Cali
Fragilistic
Expi
Aladocious
Done! Don't use GOTOs!

</pre>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">STOP_BEFORE</span> 7

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #a020f0;">for</span> (<span style="color: #228b22;">int</span> <span style="color: #a0522d;">counter</span> = 0; counter &lt; STOP_BEFORE; counter++) {
        <span style="color: #a020f0;">switch</span> (counter) {
            <span style="color: #a020f0;">case</span> 0:
                printf(<span style="color: #8b2252;">"zero "</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> 1:
                printf(<span style="color: #8b2252;">"one "</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> 2:
                printf(<span style="color: #8b2252;">"two "</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">case</span> 3:
                printf(<span style="color: #8b2252;">"three "</span>);
                <span style="color: #a020f0;">break</span>;
            <span style="color: #a020f0;">default</span>:
                printf(<span style="color: #8b2252;">"error!\n"</span>);
                <span style="color: #a020f0;">goto</span> <span style="color: #008b8b;">done</span>;
                <span style="color: #a020f0;">break</span>;
        }
    }
    <span style="color: #008b8b;">done</span>:
    printf(<span style="color: #8b2252;">"\n"</span>);
    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
zero one two three error!

</pre>
</div>
<ol class="org-ol">
<li><a id="org3b3fc00"></a>Exercise<br />
<div class="outline-text-5" id="text-1-22-0-1">
<p>
for ( int counter = 0; counter &lt; 60 ; counter += 3 ) { 
for ( int counter = 1; counter &lt; 60 ; counter *= 3 ) { 
for ( int i = 64;  i &gt; 0; i /= 2)  {
   printf("%d\n",i);
}
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #b22222;">// </span><span style="color: #b22222;">Copyright (c) 2020 Hazel Campbell</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdlib.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;string.h&gt;</span>

<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">STOP_BEFORE</span> 7

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
     <span style="color: #a020f0;">for</span> ( <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span> = 64;  i &gt; 0; i /= 2)  {
        printf(<span style="color: #8b2252;">"%d\n"</span>,i);
     }
     <span style="color: #a020f0;">return</span> 0; 
}
</pre>
</div>

<pre class="example">
64
32
16
8
4
2
1

</pre>
</div>
</li>
</ol>
</div>

<div id="outline-container-org002e5aa" class="outline-3">
<h3 id="org002e5aa"><span class="section-number-3">1.23</span> Types!</h3>
<div class="outline-text-3" id="text-1-23">
</div>
<div id="outline-container-orgf223cfd" class="outline-4">
<h4 id="orgf223cfd"><span class="section-number-4">1.23.1</span> int!</h4>
<div class="outline-text-4" id="text-1-23-1">
<p>
In C ints are often 32-bit integers. They can have a sign.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;stdio.h&gt;</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;limits.h&gt;</span>
<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>() {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">an_int</span> = 6;
    printf(<span style="color: #8b2252;">"size_of(an_int) == %ld\n"</span>, <span style="color: #a020f0;">sizeof</span>(an_int));
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">max_int</span> = INT_MAX;
    printf(<span style="color: #8b2252;">"max int == %11d\n"</span>, max_int);
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">min_int</span> = INT_MIN;
    printf(<span style="color: #8b2252;">"min int == %11d\n"</span>, min_int);
    printf(<span style="color: #8b2252;">"an_int  == %11d \t== 0x%08x\n"</span>, an_int,  an_int);
    printf(<span style="color: #8b2252;">"min_int == %11d \t== 0x%08x\n"</span>, min_int, min_int);
    printf(<span style="color: #8b2252;">"max_int == %11d \t== 0x%08x\n"</span>, max_int, max_int);
    printf(<span style="color: #8b2252;">"     -1 == %11d \t== 0x%08x\n"</span>, -1,-1);
    printf(<span style="color: #8b2252;">"      1 == %11d \t== 0x%08x\n"</span>, 1,1);
    printf(<span style="color: #8b2252;">"      0 == %11d \t== 0x%08x\n"</span>, 0,0);

    <span style="color: #a020f0;">return</span> 0;
}
</pre>
</div>

<pre class="example">
size_of(an_int) == 4
max int ==  2147483647
min int == -2147483648
an_int  ==           6 	== 0x00000006
min_int == -2147483648 	== 0x80000000
max_int ==  2147483647 	== 0x7fffffff
     -1 ==          -1 	== 0xffffffff
      1 ==           1 	== 0x00000001
      0 ==           0 	== 0x00000000

</pre>
</div>
</div>
