week02/presentation.txt

  GOTO is basically our jmp opcode from assembler except we can only go
  to labels.

  labels in code are an identifier followed by a colon:

  If you have -g flags in gcc the label will be in executable, otherwise
  it will just be an offset that you jump to.

  GOTOs can only be in the same function in C.

  ,----
  | #include <stdio.h>
  | #include <stdlib.h>
  | #include <string.h>
  | 
  | int main() {
  |     goto super;
  |     ala:
  |     printf("Aladocious\n"); 
  |     goto end;
  |     expi:
  |     printf("Expi\n");
  |     goto ala;
  |     fragi:
  |     printf("Fragilistic\n");
  |     goto expi;
  |     cali:
  |     printf("Cali\n");    
  |     goto fragi;
  |     super:
  |     printf("Super\n");    
  |     goto cali;
  |     end:
  |     printf("Done! Don't use GOTOs!");
  | }
  | 
  `----

  ,----
  | Super
  | Cali
  | Fragilistic
  | Expi
  | Aladocious
  | Done! Don't use GOTOs!
  `----

  ,----
  | // Copyright (c) 2020 Hazel Campbell
  | #include <stdio.h>
  | #include <stdlib.h>
  | #include <string.h>
  | 
  | #define STOP_BEFORE 7
  | 
  | int main() {
  |     for (int counter = 0; counter < STOP_BEFORE; counter++) {
  |         switch (counter) {
  |             case 0:
  |                 printf("zero ");
  |                 break;
  |             case 1:
  |                 printf("one ");
  |                 break;
  |             case 2:
  |                 printf("two ");
  |                 break;
  |             case 3:
  |                 printf("three ");
  |                 break;
  |             default:
  |                 printf("error!\n");
  |                 goto done;
  |                 break;
  |         }
  |     }
  |     done:
  |     printf("\n");
  |     return 0;
  | }
  `----

  ,----
  | zero one two three error!
  `----


* 1.22.0.1 Exercise

  for ( int counter = 0; counter < 60 ; counter += 3 ) { for ( int
  counter = 1; counter < 60 ; counter *= 3 ) { for ( int i = 64; i > 0;
  i /= 2) { printf("%d\n",i); }

  ,----
  | // Copyright (c) 2020 Hazel Campbell
  | #include <stdio.h>
  | #include <stdlib.h>
  | #include <string.h>
  | 
  | #define STOP_BEFORE 7
  | 
  | int main() {
  |      for ( int i = 64;  i > 0; i /= 2)  {
  |         printf("%d\n",i);
  |      }
  |      return 0; 
  | }
  `----

  ,----
  | 64
  | 32
  | 16
  | 8
  | 4
  | 2
  | 1
  `----


1.23 Types!
~~~~~~~~~~~

1.23.1 int!
-----------

  In C ints are often 32-bit integers. They can have a sign.

  ,----
  | #include <stdio.h>
  | #include <limits.h>
  | int main() {
  |     int an_int = 6;
  |     printf("size_of(an_int) == %ld\n", sizeof(an_int));
  |     int max_int = INT_MAX;
  |     printf("max int == %11d\n", max_int);
  |     int min_int = INT_MIN;
  |     printf("min int == %11d\n", min_int);
  |     printf("an_int  == %11d \t== 0x%08x\n", an_int,  an_int);
  |     printf("min_int == %11d \t== 0x%08x\n", min_int, min_int);
  |     printf("max_int == %11d \t== 0x%08x\n", max_int, max_int);
  |     printf("     -1 == %11d \t== 0x%08x\n", -1,-1);
  |     printf("      1 == %11d \t== 0x%08x\n", 1,1);
  |     printf("      0 == %11d \t== 0x%08x\n", 0,0);
  | 
  |     return 0;
  | }
  `----

  ,----
  | size_of(an_int) == 4
  | max int ==  2147483647
  | min int == -2147483648
  | an_int  ==           6 	== 0x00000006
  | min_int == -2147483648 	== 0x80000000
  | max_int ==  2147483647 	== 0x7fffffff
  |      -1 ==          -1 	== 0xffffffff
  |       1 ==           1 	== 0x00000001
  |       0 ==           0 	== 0x00000000
  `----


1.23.2 unsigned ints!
---------------------
