week02/presentation.txt

  You can only non-negative integers if you want

  ,----
  | #include <stdio.h>
  | #include <limits.h>
  | int main() {
  |     unsigned int an_int = 6;
  |     printf("size_of(an_int) == %ld\n", sizeof(an_int));
  |     unsigned int max_int = UINT_MAX;
  |     printf("max int == %11u\n", max_int);
  |     unsigned int min_int = 0;
  |     printf("min int == %11u\n", min_int);
  |     printf("an_int  == %11u \t== 0x%08x\n", an_int,  an_int);
  |     printf("min_int == %11u \t== 0x%08x\n", min_int, min_int);
  |     printf("max_int == %11u \t== 0x%08x\n", max_int, max_int);
  |     printf("     -1 == %11u \t== 0x%08x\n", -1,-1);
  |     printf("      1 == %11u \t== 0x%08x\n", 1,1);
  |     printf("      0 == %11u \t== 0x%08x\n", 0,0);
  |     return 0;
  | }
  `----

  ,----
  | size_of(an_int) == 4
  | max int ==  4294967295
  | min int ==           0
  | an_int  ==           6 	== 0x00000006
  | min_int ==           0 	== 0x00000000
  | max_int ==  4294967295 	== 0xffffffff
  |      -1 ==  4294967295 	== 0xffffffff
  |       1 ==           1 	== 0x00000001
  |       0 ==           0 	== 0x00000000
  `----
